### Imports

In [1]:
import pandas as pd
from sqlalchemy import create_engine
import pyodbc

### Read csv

In [2]:
df = pd.read_csv('sample_data/03_Library SystemCustomers.csv')

### Drop null values

In [3]:
df = df.dropna(subset='Customer ID')

### Standardise column names

In [4]:
df.columns = df.columns.str.lower().str.replace(' ','_')

### Cast Integers

In [5]:
df = df.astype({'customer_id': int})

### Output to csv

In [6]:
df.to_csv('output_data/customers_output.csv', index=False)

### Output to SQL Server

In [7]:
engine = create_engine('mssql+pyodbc://@localhost/m5library?driver=ODBC+Driver+17+for+SQL+Server')

df.to_sql('customers_output', engine, if_exists='replace', index=False)

#trying to get sql server login to work...

8

In [8]:
df

   customer_id     customer_name
0            1          Jane Doe
1            2        John Smith
2            3        Dan Reeves
4            5    William Holden
5            6     Jaztyn Forest
6            7     Jackie Irving
7            8  Matthew Stirling
8            9         Emory Ted